// LabNo5.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <iomanip>
using namespace std;
int main()
{
	setlocale(LC_ALL, "ru");
	int m,n;
	int a[100][100];
	int val;
	cout << "Введите начальное число: ";
	cin >> val;
	cout << "Введите количесто строк: ";
	cin >> m;
	cout << "Введите количесто столбцов: ";
	cin >> n;
	int mt = m;
	int nt = n;
	int k = 0, l = 0;
	while (k < m && l < n)
	{
		for (int i = l; i < n; ++i)
			a[k][i] = val++;

		k++;

		for (int i = k; i < m; ++i)
			a[i][n - 1] = val++;
		n--;

		if (k < m)
		{
			for (int i = n - 1; i >= l; --i)
				a[m - 1][i] = val++;
			m--;
		}

		if (l < n)
		{
			for (int i = m - 1; i >= k; --i)
				a[i][l] = val++;
			l++;
		}
	}

	for (int i = 0; i < mt; i++)
	{
		for (int j = 0; j < nt; j++)
			cout << setw(4) << a[i][j] << " ";
		cout << endl;
	}
	return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
